brew "bash-language-server"
brew "bat"
brew "chezmoi"
brew "cosign"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "helix"
brew "htop"
brew "jq"
brew "just"
brew "lld"
brew "mold"
brew "ollama"
brew "ripgrep"
brew "rustup"
brew "rust-analyzer"
brew "shellcheck"
brew "starship" 

# set arguments for all `brew install --cask` commands
cask_args require_sha: true

tap "homebrew/linux-fonts" if OS.linux?
brew "homebrew/linux-fonts/font-jetbrains-mono-nerd-font"
